#+AUTHOR:    Anton S. Kosinov
#+TITLE:     Mental Athlete ToDo List
#+SUBTITLE:  Life in a plain text
#+EMAIL:     a.s.kosinov@gmail.com
#+LANGUAGE: en
#+STARTUP: showall
#+PROPERTY:header-args :results output :exports both
# :session :cache yes :tangle yes :comments org 
#+CATEGORY: Thesis
#+TODO: TODO ACTIVE IN_PROGRESS | MAYBE DONE CLOSED

* TODO [#A] Time Management

** CLOSED General concepts overview
   <2018-02-26 Mon 10:00-12:00>

** ACTIVE Daily agenda elaboration
   :LOGBOOK:
   CLOCK: [2018-03-03 Sat 11:43]--[2018-03-03 Sat 12:06] =>  0:23
   :END:
   <2018-03-04 Sun 07:40-08:05 +1d>
   
** TODO [#C] Implementation in Org-mode studying :ARCHIVE:
   <2018-02-26 Mon 12:00-13:00>

** MAYBE Configuring Gnome3 desktops
   <2018-02-28 Wed 11:30-11:55>
   :PROPERTIES:
   :CATEGORY: Desktop
   :END:
   It might be convinient to allocate the particular window of each
   applicaton on several (appropriate 4) desktops to switch between
   tasks in a smooth manner, just by switching current desktop.


* English
** Grammar
*** TODO Past tenses
    <2018-02-15 Thu 12:00-13:00>
    Elaborate an initial [[file:/usr/local/git/0--key/lib/org/eng_grammar.org::*Past%20simple][org-drill]]
** Vocabulary
** Writing
* Emacs
** Org-mode
*** IN_PROGRESS Calendar
    :LOGBOOK:
    CLOCK: [2018-03-03 Sat 12:29]--[2018-03-03 Sat 12:55] =>  0:26
    :END:
    <2018-02-09 Fri 08:20-08:45>
    <2018-03-03 Sat 12:35-13:00>
**** CLOSED Sunrise
     <2018-03-17 Sat 13:35-13:45>
     Follow this [[info:Emacs#Sunrise/Sunset][link]] and set ~longitude and latitude~ in =default.el=
*** IN_PROGRESS [#B] Agenda features dissection
    :LOGBOOK:
    CLOCK: [2018-03-04 Sun 10:16]--[2018-03-04 Sun 10:35] =>  0:19
    CLOCK: [2018-03-04 Sun 10:16]--[2018-03-04 Sun 10:16] =>  0:00
    :END:
    <2018-03-04 Sun 12:05-12:30>
    - Export int .ics
    - Import into specific Google Calendar
**** DONE Timestamps
    <2018-02-28 Wed 17:30-18:25> 
**** DONE Creating timestamps
     <2018-02-28 Wed 18:30-18:55>
**** DONE Deadlines and scheduling
     <2018-02-28 Wed 19:00-19:25>
**** CLOSED Additional state 'MayBe'
     <2018-02-28 Wed 19:30-19:55>
***** ACTIVE Additional workflow states
      :LOGBOOK:
      CLOCK: [2018-03-02 Fri 17:49]--[2018-03-02 Fri 18:14] =>  0:25
      CLOCK: [2018-03-02 Fri 11:56]--[2018-03-02 Fri 12:09] =>  0:13
      :END:
      <2018-03-04 Sun 11:30-11:55>
      + OPEN
      + ACTIVE
      + REOPENED
      + IN PROGRESS
      + RESOLVED
      + COMPLETED
      + COMMITTED
      + CLOSED
      + REMOVED
****** CLOSED New states classification
       <2018-03-02 Fri 17:50-18:15>
******* Innate
	- TODO - very initial state
	- DONE - final and infinite for a week
******* CLOSED Additional for leaning stages
	+ ACTIVE - after initial first pomodoro
	+ IN PROGRESS - three <= pomodoro <=five
	+ MAYBE - postponed
	+ CLOSED - next Moon
****** ACTIVE Average workflow
       :LOGBOOK:
       CLOCK: [2018-03-02 Fri 18:25]--[2018-03-02 Fri 18:38] =>  0:13
       CLOCK: [2018-03-02 Fri 18:21]--[2018-03-02 Fri 18:22] =>  0:01
       :END:
       <2018-03-03 Sat 18:20-18:45>

       The main is an initial core for =TODO= tasks, and it should be
       extended by several satellite files in the =org= folder. So,
       browsing somwhere it might be possible to assign any task and
       include it into your agenda view by =TODO= state.

       The initial dissection of some particular task would change its
       state into =ACTIVE=, on a flip side - rejection of this task
       changes its state into =MAYBE=. It's is just the second
       preliminary classification and it is absolutely normal to
       reject 80% of items previously choosen.

       After the second sift you'll get a set of tasks in three
       aggregate states:

       - TODO - they all demand a secondary classification
       - ACTIVE - processed and resolving
       - MAYBE - postponed for a month or later
****** 
**** IN_PROGRESS Regular events scheduling
     :LOGBOOK:
     CLOCK: [2018-03-04 Sun 17:02]--[2018-03-04 Sun 17:23] =>  0:21
     :END:
     <2018-03-06 Tue 09:30-09:55>
     
**** DONE Clocking work time
     <2018-03-01 Thu 09:00-09:25>
     <2018-03-01 Thu 17:00-17:25>
**** CLOSED Effort estimates
     :PROPERTIES:
     :Effort:   1:00
     :END:
     :LOGBOOK:
     CLOCK: [2018-03-03 Sat 13:49]--[2018-03-03 Sat 13:52] =>  0:03
     CLOCK: [2018-03-03 Sat 13:34]--[2018-03-03 Sat 13:49] =>  0:15
     CLOCK: [2018-03-01 Thu 09:39]--[2018-03-01 Thu 09:53] =>  0:14
     :END:
     <2018-03-01 Thu 09:30-09:55>
     <2018-03-05 Mon 12:00-12:25>
     <2018-03-03 Sat 13:35-14:00>
     [[info:org#Effort%20estimates][info:org#Effort estimates]]
**** DONE Timers
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 09:59]--[2018-03-01 Thu 10:02] =>  0:03
     :END:
     <2018-03-01 Thu 10:00-10:25>
**** DONE Org-pomodoro
     :LOGBOOK:
     CLOCK: [2018-03-01 Thu 10:03]--[2018-03-01 Thu 10:12] =>  0:09
     :END:
     <2018-03-01 Thu 10:30-10:55>
*** ACTIVE Capture
    <2018-02-22 Thu 17:00-18:00>
    Make capture for org-drill items generation with minimal
    interruption
*** IN_PROGRESS Macros
    :LOGBOOK:
    CLOCK: [2018-03-03 Sat 13:01]--[2018-03-03 Sat 13:24] =>  0:23
    CLOCK: [2018-03-02 Fri 18:55]--[2018-03-02 Fri 19:17] =>  0:22
    CLOCK: [2018-03-01 Thu 18:23]--[2018-03-01 Thu 18:48] =>  0:25
    :END:
    <2018-03-04 Sun 17:05-17:30>
    To convert =voca-builder= item into =Drill=
**** ACTIVE [#A] Org-drill scrutiny
     :LOGBOOK:
     CLOCK: [2018-03-04 Sun 08:59]--[2018-03-04 Sun 10:16] =>  1:17
     CLOCK: [2018-03-03 Sat 18:01]--[2018-03-03 Sat 18:21] => 0:20
     :END:
     <2018-03-04 Sun 09:00-09:20>
     
**** CLOSED Vocabla items classification
     - Pristine
       Three sections (most of them)

     - Corrupted
       + Rare words
**** TODO Wrong mark-up in vocabulary
     <2018-03-05 Mon 11:30-11:55>

	 Should be fixed manually once a month, because
         otherwise you don't have enough time to learn and rehearse
         the set of already collected.
**** CLOSED Additional combinations
     - C-x () start/end macros definition
     - C-x e execute it
**** CLOSED Make a function and save it for future usage
     - ‘C-x C-k n’ - assign a new name for ~hot~ macros
     - ‘M-x insert-kbd-macro’ - spew ~hot~ macros into current buffer

       [[info:emacs#Save%20Keyboard%20Macro][info:emacs#Save Keyboard Macro]]
** Python-mode
* Programming
** Theory
*** Formal Methods of Software Design
**** TODO Introduction
     <2018-02-13 Tue 08:30-08:55>
**** TODO Extract the binary terminology
     <2018-02-17 Sat 13:30-13:55>
** Practice
*** Data Visualisation
    <2018-02-20 Tue 18:00-19:00>
*** Big data meta-analysis
    <2018-02-27 Tue 17:00-17:55>

